#include "include.h"

/***************************************************************************************
  * @说明  	初始化函数
  *	@参数	无
  * @返回值 无
  * @注		无
***************************************************************************************/
void SystemInit(void)
{
/********************************时钟系统初始化****************************************/
	CLKSWR = 0x50;						//选择内部高频RC为系统时钟，内部高频RC 1分频，Fosc=32MHz
	CLKDIV = 0x02;						//Fosc 2分频得到Fcpu，Fcpu=16MHz 
	FREQ_CLK=0x10;           //设定当前系统时钟 Fcpu=16MHz	
/***********************************WDT配置初始化**************************************/
	WDTC = 0x5F;						//允许WDT复位，允许掉电/空闲模式下运行，128分频
	WDTCCR = 0xFF;					//写入00时，将关闭WDT功能（但不关闭内部低频RC），6S
/**********************************相关配置初始化**************************************/
//////////////////////////////////////////////////////////////////////////////	
	P0M2 = P0M2 & 0xF0 | 0x02;				    //P04设置为上拉输入
//////////////////////////////////////////////////////////////////////////////
/**********************************TIM1配置初始化**************************************/	
	TCON1 = 0x00;						//T1定时器时钟为Fosc,Fosc=32MHz,12分频
	TMOD = 0x00;						//16位重装载定时器/计数器
	TH1 = 0xF5;
	TL1 = 0x96;							//T1定时时间1ms
	ET1=1;									//T1 enable
	TR1=0;									//T1 start fail
	
	LVDC = 0xAA; //
	LVDDBC = 0xFF; //
	LVDC &= ~0x08; //
}

void GPIO_Init(void)
{
#ifdef V10
	P0M0 = P0M0 & 0xF0 | 0x08; //P00
	P0M0 = P0M0 & 0x0F | 0x30; //P01
	P0M3 = P0M3 & 0x0F | 0x30; //P07
	P0M3 = P0M3 & 0xF0 | 0x08; //P06
#endif

#ifdef V11
	P0M0 = P0M0 & 0xF0 | 0x08; //P00设置为推挽输出
	P0M0 = P0M0 & 0x0F | 0x30; //P01设置为模拟输入
	P0M2 = P0M2 & 0x0F | 0x80; //P05设置为推挽输出
	P0M3 = P0M3 & 0xF0 | 0x03; //P06设置为模拟输入
	P0M3 = P0M3 & 0x0F | 0x20; //P07设置为上拉输入
#endif

#ifdef V12
	P1M0 = P1M0 & 0xFF | 0x88; //P10设置为推挽输出
							   //P11设置为推挽输出
	P0M0 = P0M0 & 0x0F | 0x30; //P01设置为模拟输入
	P2M1 = P2M1 & 0xF0 | 0x03; //P22设置为模拟输入
#endif

#ifdef XBR403_01
	P1M0 = P1M0 & 0xFF | 0x88; //P10设置为推挽输出
							   //P11设置为推挽输出

	
	P1_0 = 1;
	P1_1 = 1;
#endif

#ifdef XBR403
	//PWM & ADC
	P1M0 = P1M0 & 0xF0 | 0x08; //P10设置为推挽输出
	P0M0 = P0M0 & 0xFF | 0x88; //P00设置为推挽输出
							   //P01设置为推挽输出
	P0M1 = P0M1 & 0xFF | 0x83; //P03设置为推挽输出
							   //P02设置为模拟输入
	P0M3 = P0M3 & 0xF0 | 0x08; //P06设置为推挽输出
	P2M1 = P2M1 & 0xF0 | 0x03; //P22设置为模拟输入
#endif

#ifdef XBR403_03_2
	 //PWM & ADC
	 P1M0 = P1M0 & 0x0F | 0x80; //P11  r
	 P0M0 = P0M0 & 0xF0 | 0x03; //P00  if adc an0
	 P0M0 = P0M0 & 0x0F | 0x80; //P01  ww
	 P0M1 = P0M1 & 0xF0 | 0x08; //P02  g
	 P0M1 = P0M1 & 0x0F | 0x80; //P03  b
	 P0M3 = P0M3 & 0x0F | 0x30; //P07  light adc an7
	 P2M3 = P2M3 & 0x0F | 0x80; //P27  cw
#endif

}
